export const ItQuizData01 = [
    {
        question: "소프트웨어의 설명으로 옳지 않은 것을 고르시오",
        options:[ 
            "1. 소프트웨어에는 시스템 소프트웨어와 응용소프트웨어로 나뉜다.", 
            "2. 사용자가 원하는 기능을 하는 소프트웨어를 응용소프트웨어라고 한다.", 
            "3. 하드웨어에게 무엇을 할지, 어떻게 할지 명령을 내리는 역할을 한다.",
            "4. 쉽게 변형할 수 없는 물리적 구성요소이다."],
        answer: 4
    },
    {
        question: "컴퓨터가 문제를 처리하는 과정을 순서에 맞게 나열하세요.",
        options:[
            "1. 정보획득 -> 정보출력 -> 정보저장 -> 정보처리", 
            "2. 정보획득 -> 정보저장 -> 정보처리 -> 정보출력", 
            "3. 정보획득 -> 정보처리 -> 정보저장 -> 정보출력", 
            "4. 정보획득 -> 정보저장 -> 정보출력 -> 정보처리"],
        answer: 2
    },
    {
        question: "RAM에 관한 설명으로 옳은 것은?",
        options: [
            "1. 속도가 느리다.", 
            "2. 용량이 크다.", 
            "3. 'Memory'라고도 말한다.",
            "4. 시각적인 영상으로 모니터에 그려주는 역할을 한다."],
        answer: 3
    },
    {
        question: "프로세스와 스레드에 대한 설명으로 옳지 않은 것은?",
        options: [
        "1. 프로세스는 명령어가 실행되는 순서의 집합이다.", 
        "2. 프로세스는 운영체제로부터 자원을 할당 받아 실행된다.",
        "3. 스레드는 프로세스 내에서 실행되는 작업의 단위이다.", 
        "4. 멀티 스레드는 여러 개의 스레드가 동시에 작업을 수행하는 것이다."],
        answer:1
    },
];